cases/flowPastSphere/OpenFOAM-13/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            forceCoeffs;
libs            ("libforces.so");

writeControl    timeStep;
timeInterval    1;

log             yes;

patches         (sphere);

rho             rhoInf;      // Indicates incompressible
rhoInf          1;           // Redundant for incompressible
liftDir         (0 0 1);
dragDir         (1 0 0);
CofR            (0 0 0);  // Axle midpoint on ground
pitchAxis       (0 1 0);
magUInf         1.0;
lRef            1.0;        // Wheelbase length
Aref            0.785;        // Estimated

// ************************************************************************* //
