cases/flowPastSphere/OpenFOAM-13/Allrun
mpirun -np 4 foamRun -solver incompressibleFluid -parallel